[
    {
        "title": "Jumping in to new ideas",
        "thought": "Me and Sonith are thinking of a new idea. A desktop app that can integrate within workflows. It's an interesting idea that has a lot of potential but the problem is, I have no clue how to build desktop apps, I just got into the hang of building webapps, which was why I build this personal website, just to get more practice. From what I can tell, Electron is the best framework to build desktop apps using familiar tech as it installs an entire chrome browser in an app. When I jumped into it though, there's some serious differences between the two, especially when it comes to HTTP requests and creating your own APIs. At first, I tried jumping into this idea to create an MVP, the problem is though, I'm relying on AI to fix mistakes and not particularly understanding the fixes it's making. This happened when building Chatty and the result was a lot of the codebase became a mystery for me. I'm going to take today to build 2 small and basic electron apps, hopefully some utilizing APIs, creating my own APIs, and overall practice with the framework. Then jump into building the MVP ",
        "time": "01-14-2025"
    },
    {
        "title": "New Ideas and Influence",
        "thought": "New Ideas: \nI think the best ideas are ones that you could find yourself useful. Grubhub was created because people had to call a restaurant to figure out if they deliver, Netflix from the inconvenience of renting movies, and PayPal from slow money transfers. There's a myth that all the \"good ideas\" are taken and such there will never be companies that stack up against the Apples and Googles of the world. I disagree. Many people think all good ideas are taken because it seems to be obvious, \"Of course I should be able to call a taxi from the press of a button on my phone\". At one point, these ideas weren't so obvious, they took a combination of lived experiences and the mindset that things can be, no, must be better. In many cases, the creator of these companies will be it's number 1 customers because after all they faced the problem!\n  \n\nInfluence: At the time of this thought I am in Jaipur, India. When traveling to a place like this, where my parents don't really know the area that well, we hire a driver from the hotel that we stay at that acts like our tour guide of the city. Born and raised here, he took us to popular tourist spots and restaurant but also gems of the city. Small mom and pop shops in alley ways that sell the best hand made art and where the prices are fair (not the \"foreign prices\"), the best lassi shop in the city that he grew up drinking, and history (and gossip) of the city that only locals hear. One of the stops on this trip to Jaipur was Amer (Man Singhs fortress), and unfortunately we ran late and the line to the fort was an hour and a half long (yikes). One call to his buddy and we were able to drive up the back road of fortress, skipping the line entirely. On the way back, road closer would have required us to travel 50 additional miles. One call to head chief police of the area (also a friend from the city) and we were able to drive through the closed road. Despite the driver making much less money than the people he drives, he has more influence in that city than all of them combined. Rest assured, we left him a big tip!",
        "time": "01-02-2025"
    },
    {
        "title": "Hello World",
        "thought": "This is my very first blog/thought, thanks for stopping by! I always wanted to journal but I never consistently carried around my notepad and my thoughts were always unorganized. So, when I wanted to rebuild my personal website, I knew I wanted a tab where I could easily post my thoughts and have it all in one place to come back to. I feel I'll be journaling a lot more as I move to SF after graduating and I'll have a lot to reflect on so hopefully this page will get pretty big so one day I can look back on  these thoughts I had back in my 20s!\n\nNote to self: Add an edit page for thought page/admin profile maybe if I end up using this a lot.",
        "time": "12-31-2024"
    }
]